# Part1 - Import libraries and new customer dataset

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
# Create path 
path = r'C:\Users\supri\Desktop\Supriya\DataAnalysis\Project\Data Immersion\Achievement 1-2\Instacart_Basket_Analysis'

In [3]:
# Import new customer data set from the 'Original Data' folder as a dataframe
customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

In [4]:
# Check the imported dataframe 
customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [5]:
customers.shape

(206209, 10)

In [6]:
#Descriptive statistics 
customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [7]:
# Check data types
customers.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [8]:
#Customers info
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

## Step 4 - Wrangle the data so that it follows consistent logic

In [9]:
# Rename First Name as first_name
customers.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [10]:
# Rename Surnam as last_name
customers.rename(columns = {'Surnam' : 'last_name'}, inplace = True)

In [11]:
# Rename Gender as gender
customers.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [12]:
# Rename STATE as state
customers.rename(columns = {'STATE' : 'state'}, inplace = True)

In [13]:
# Rename Age as age
customers.rename(columns = {'Age' : 'age'}, inplace = True)

In [14]:
# Rename fam_status as marital_status
customers.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

In [15]:
# Check column name
customers.columns

Index(['user_id', 'first_name', 'last_name', 'gender', 'state', 'age',
       'date_joined', 'n_dependants', 'marital_status', 'income'],
      dtype='object')

In [16]:
#Column names changed to clear and similar form.

In [17]:
#Check output
customers.head()

,user_id,first_name,last_name,gender,state,age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [18]:
#For now I don't think I need to drop any column as they seem to be relevant.

## Step 5 - Data Quality and consistency checks

In [19]:
# Check for mixed data-types in the dataframe
customers.dtypes

user_id            int64
first_name        object
last_name         object
gender            object
state             object
age                int64
date_joined       object
n_dependants       int64
marital_status    object
income             int64
dtype: object

In [20]:
# Checking for mixed data-types in each column
for col in customers.columns.tolist():
  weird = (customers[[col]].map(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

first_name

In [21]:
# The output indicated that the 'first_name' column has mixed data-types 
customers['first_name'] = customers['first_name'].astype('str')

In [22]:
# Re-check the data-types for mixed data-types
customers.dtypes

user_id            int64
first_name        object
last_name         object
gender            object
state             object
age                int64
date_joined       object
n_dependants       int64
marital_status    object
income             int64
dtype: object

In [23]:
for col in customers.columns.tolist():
  weird = (customers[[col]].map(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

In [24]:
# All columns have the appropriate data-types ,no mixed data-types are present in any columns

In [25]:
# Checking for missing data
customers.isnull().sum()

user_id           0
first_name        0
last_name         0
gender            0
state             0
age               0
date_joined       0
n_dependants      0
marital_status    0
income            0
dtype: int64

In [26]:
# Check for duplicates
customers_dups = customers[customers.duplicated()]

In [27]:
#Check output
customers_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, n_dependants, marital_status, income]
Index: []

In [28]:
# Descriptive statistic check
customers.describe()

             user_id            age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [29]:
#No duplicates found and descriptive statistics look ok

## Step 6 - Combine your customer data with the rest of your prepared Instacart data

In [30]:
# Import the rest of the prepared Instacart data
ords_prods = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_merged_derived_new_variables_aggregated.pkl'))

In [31]:
# Check the shape of the newly imported dataframe
ords_prods.shape

(32404859, 27)

In [32]:
# Check the shape of the customers dataframe
customers.shape

(206209, 10)

In [33]:
# Check output
ords_prods.head()

,Unnamed: 0.1,order_id,user_id,eval_set,order_number,orders_days_of_week,order_hour_of_day,days_since_prior_order,first_time_customers,product_id,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,average_price,spending_flag,customer_frequency,frequency_flag
0,0,2539329,1,prior,1,2,8,NaN,True,196,...,Mid-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low_spender,20.5,Non-frequent customer
1,0,2539329,1,prior,1,2,8,NaN,True,14084,...,Mid-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low_spender,20.5,Non-frequent customer
2,0,2539329,1,prior,1,2,8,NaN,True,12427,...,Low-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low_spender,20.5,Non-frequent customer
3,0,2539329,1,prior,1,2,8,NaN,True,26088,...,Low-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low_spender,20.5,Non-frequent customer
4,0,2539329,1,prior,1,2,8,NaN,True,26405,...,Low-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low_spender,20.5,Non-frequent customer

In [34]:
customers.head()

,user_id,first_name,last_name,gender,state,age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [35]:
#The key columns are user_id and both are the same data type
#Check datatype
ords_prods.dtypes['user_id']

dtype('int64')

In [36]:
customers.dtypes['user_id']

dtype('int64')

In [37]:
# Make sure both key columns are the same data type
ords_prods['user_id'] = ords_prods['user_id'].astype('str')

In [38]:
ords_prods.dtypes['user_id']

dtype('O')

In [39]:
customers.dtypes['user_id']

dtype('int64')

In [40]:
# Make sure both key columns are the same data type
customers['user_id'] = customers['user_id'].astype('str')

In [41]:
customers.dtypes['user_id']

dtype('O')

In [42]:
# Merge the two dataframes using the column 'user_id' as the shared column with the default join (inner)

In [43]:
custs_ords_prods = ords_prods.merge(customers, on = 'user_id', indicator = True)

In [44]:
# Check shape of newly merged dataframe
custs_ords_prods.shape

(32404859, 37)

In [45]:
custs_ords_prods.head(5)

,Unnamed: 0.1,order_id,user_id,eval_set,order_number,orders_days_of_week,order_hour_of_day,days_since_prior_order,first_time_customers,product_id,...,first_name,last_name,gender,state,age,date_joined,n_dependants,marital_status,income,_merge
0,0,2539329,1,prior,1,2,8,NaN,True,196,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
1,0,2539329,1,prior,1,2,8,NaN,True,14084,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
2,0,2539329,1,prior,1,2,8,NaN,True,12427,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
3,0,2539329,1,prior,1,2,8,NaN,True,26088,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
4,0,2539329,1,prior,1,2,8,NaN,True,26405,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both

In [46]:
# Check data-types
custs_ords_prods.dtypes

Unnamed: 0.1                 int64
order_id                     int64
user_id                     object
eval_set                    object
order_number                 int64
orders_days_of_week          int64
order_hour_of_day            int64
days_since_prior_order     float64
first_time_customers          bool
product_id                   int64
add_to_cart_order            int64
reordered                    int64
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
match                     category
price_range_loc             object
busiest_day                 object
busiest_days                object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
average_price              float64
spending_flag               object
customer_frequency         float64
frequency_flag              object
first_name                  object
last_name                   object
gender                      object
state                       object
age                          int64
date_joined                 object
n_dependants                 int64
marital_status              object
income                       int64
_merge                    category
dtype: object

In [47]:
# The 'order_id' column changed to str
custs_ords_prods['order_id'] = custs_ords_prods['order_id'].astype('str')

### Step 08. Export new dataframe as a pickle file to continue to use it in the second part of the task

In [48]:
custs_ords_prods.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'ordrs_prods_customers_merged.pkl'))